[
    {
        "_id": "8356cb02-ab69-46e3-a8be-09f5fe0e012b",
        "picture": "https://i.ibb.co/mJwwhgB/asad-latif.jpg",
        "name": "Asad Latif",
        "description": "Gourmet expert Asad is a masterful Chef from Bangladesh who gives grand cooking formulas on Lazzat with Asad on Metro One. He is the new master specialist that will undoubtedly stay viewers adhere to their TVs, regardless of whether they get joy from cooking or not. He likewise entertains gatherings of people with prompt answers for cooking tragedies.",
        "years_of_experience": 12,
        "recipes_count": 3,
        "recipes": [
            {
                "id": 1,
                "name": "Radish Greens (Leaf) stir fry",
                "ingredients": [
                    "3 cup clean and chopped radish green leaf",
                    "2 tablespoon chopped onions",
                    "2 green chillies",
                    "2 dry red chilli",
                    "1 teaspoon chopped garlic",
                    "2 tablespoon Mustard Oil",
                    "To taste Salt"
                ],
                "cooking_method": [
                    "Rinse the radish green leaves thoroughly and chop them into bite-sized pieces. Set them aside.",
                    "Finely chop 2 tablespoons of onions, 2 green chillies, and 2 dry red chillies. Set them aside.",
                    "In a pan, heat 2 tablespoons of Mustard Oil over medium heat.",
                    "Add 2 dry red chillies to the oil and let them sizzle for a few seconds.",
                    "Add 1 teaspoon of chopped garlic to the oil and sauté for about a minute or until the garlic is fragrant and slightly golden.",
                    "Add the chopped onions to the pan and sauté until they turn translucent and slightly golden.",
                    "Add the chopped green chillies to the pan and sauté for a minute or until they start to change color.",
                    "Add the chopped radish green leaves to the pan and mix well.",
                    "Sprinkle salt to taste and mix well.",
                    "Cover the pan with a lid and cook for 5-7 minutes or until the radish green leaves are wilted and tender.",
                    "Once the radish green leaves are cooked, turn off the heat and transfer the stir fry to a serving bowl.",
                    "Serve hot as a side dish with roti, rice, or any main course of your choice."
                ],
                "rating": "4.6"
            },
            {
                "id": 2,
                "name": "Beef Coconut",
                "ingredients": [
                    "2 cup beef chopped in medium large size",
                    "1/2 cup water",
                    "1 cup Coconut Milk",
                    "pieces Some whole coconut",
                    "2 tablespoon chopped onions",
                    "2 tablespoon oil",
                    "To taste Salt",
                    "2 teaspoon ginger-garlic paste",
                    "2 teaspoon red chilli powder",
                    "1 teaspoon termeric powder",
                    "2 teaspoon Coriander powder",
                    "1.5 teaspoon garam masala powder",
                    "2 tablespoon sour yougard",
                    "2 bay leaves",
                    "1/2 teaspoon brown sugar"
                ],
                "cooking_method": [
                    "In a pressure cooker or a heavy-bottomed pan, heat 2 tablespoons of oil over medium heat.",
                    "Add 2 bay leaves and 2 tablespoons of chopped onions to the pan and sauté until the onions are translucent.",
                    "Add 2 teaspoons of ginger-garlic paste and sauté until the raw smell disappears.",
                    "Add 2 cups of beef to the pan and stir well.",
                    "Add 2 teaspoons of red chilli powder, 1 teaspoon of turmeric powder, 2 teaspoons of coriander powder, 1.5 teaspoons of garam masala powder, and salt to taste. Mix well.",
                    "Add 1/2 cup of water to the pan and stir well.",
                    "Close the pressure cooker lid and cook for 15-20 minutes or until the beef is tender. If using a heavy-bottomed pan, cover with a lid and cook for about 45-50 minutes or until the beef is tender, stirring occasionally.",
                    "Once the beef is tender, add 1 cup of coconut milk to the pan and mix well.",
                    "Add some pieces of whole coconut to the pan and mix well.",
                    "Add 2 tablespoons of sour yogurt to the pan and mix well.",
                    "Add 1/2 teaspoon of brown sugar to the pan and mix well.",
                    "Cook for another 5-10 minutes or until the curry reaches your desired consistency.",
                    "Turn off the heat and transfer the beef coconut to a serving bowl.",
                    "Garnish with some chopped coriander leaves and serve hot with rice or any bread of your choice."
                ],
                "rating": 5
            },
            {
                "id": 3,
                "name": "Coconut Milk Pulao Thali",
                "ingredients": [
                    "1 cup Chinigura rice soaked in water",
                    "1 cup water",
                    "1/2 cup Coconut Milk",
                    "To taste Salt",
                    "1 teaspoon ginger-garlic paste",
                    "2 green chillies",
                    "1/2 teaspoon garam masala powder",
                    "1 tablespoon chopped onions",
                    "1 tablespoon oil",
                    "2 bay leaves"
                ],
                "cooking_method": [
                    "In a pan, heat 1 tablespoon of oil over medium heat.",
                    "Add 2 bay leaves to the pan and sauté for a few seconds until fragrant.",
                    "Add 1 tablespoon of chopped onions to the pan and sauté until translucent.",
                    "Add 1 teaspoon of ginger-garlic paste and sauté until the raw smell disappears.",
                    "Add 2 green chillies and 1/2 teaspoon of garam masala powder to the pan and mix well.",
                    "Drain the water from 1 cup of soaked Chinigura rice and add the rice to the pan. Mix well with the spices.",
                    "Add 1 cup of water to the pan and mix well.",
                    "Add salt to taste and mix well.",
                    "Bring the mixture to a boil over high heat, then reduce the heat to low, cover the pan with a lid, and simmer for 10-12 minutes or until the rice is cooked and the water has evaporated.",
                    "Once the rice is cooked, add 1/2 cup of coconut milk to the pan and mix well.",
                    "Cook for another 2-3 minutes or until the coconut milk is absorbed by the rice.",
                    "Turn off the heat and let the pulao rest for a few minutes.",
                    "Serve the Coconut Milk Pulao Thali hot with your favorite side dishes, such as raita, pickle, and salad."
                ],
                "rating": 4.9
            }
        ],
        "likes": 1356
    },
    {
        "_id": "c7d705de-1abe-4baf-916f-4c1a4a35fb33",
        "picture": "https://i.ibb.co/ww8d2dt/siddika-kabir.jpg",
        "name": "Siddiqua Kabir",
        "description": "Siddiqua Kabir (May 7, 1931 – January 31, 2012) was a Bangladeshi nutritionist, scholastic, cookbook writer andcooking show TV have. A teacher, Kabir facilitated and visitor featured in various network shows featuring Bangladeshi food, including Siddiqua Kabir’s Recipe on NTV Bangla . Kabir got honors from the culinary and media businesses, including the Sheltech Award, which was given to her in 2009. Her countless contributions for Bangladesh food, she is ranked at fourth position among top 10 chefs in Bangladesh.",
        "years_of_experience": 20,
        "recipes_count": 3,
        "recipes": [
            {
                "id": 1,
                "name": "Beef Tripe Stir Fry",
                "ingredients": [
                    "2 cups boiled and chopped Beef Tripe",
                    "3 tablespoon chopped onions",
                    "3 dry red chillies",
                    "3 tablespoon mustard oil",
                    "1.5 teaspoon termeric powder",
                    "2 teaspoon red chilli powder",
                    "3 teaspoon Coriander powder",
                    "2 teaspoon cumin powder",
                    "2 tablespoon ginger-garlic paste",
                    "1.5 cup water",
                    "2 bay leaves",
                    "2 teaspoon garam masala powder"
                ],
                "cooking_method": [
                    "In a pan, heat 3 tablespoon of mustard oil over medium heat.",
                    "Add 3 dry red chillies and sauté for a few seconds until fragrant.",
                    "Add 3 tablespoon of chopped onions to the pan and sauté until translucent.",
                    "Add 2 tablespoon of ginger-garlic paste and sauté until the raw smell disappears.",
                    "Add 1.5 teaspoon of turmeric powder, 2 teaspoon of red chilli powder, 3 teaspoon of coriander powder, and 2 teaspoon of cumin powder to the pan and mix well.",
                    "Add 2 cups of boiled and chopped Beef Tripe to the pan and mix well with the spices.",
                    "Add 1.5 cup of water to the pan and mix well.",
                    "Add 2 bay leaves to the pan and bring the mixture to a boil over high heat.",
                    "Reduce the heat to low, cover the pan with a lid, and let it simmer for 15-20 minutes or until the tripe is cooked and tender.",
                    "Once the tripe is cooked, remove the lid and increase the heat to high.",
                    "Stir fry the tripe for 3-4 minutes or until the water has evaporated and the spices have coated the tripe.",
                    "Add 2 teaspoon of garam masala powder to the pan and mix well.",
                    "Cook for another 2-3 minutes or until the tripe is dry and fully coated with the spices.",
                    "Turn off the heat and transfer the Beef Tripe Stir Fry to a serving dish.",
                    "Serve hot with rice or bread."
                ],
                "rating": 4.5
            },
            {
                "id": 2,
                "name": "Chicken Curry",
                "ingredients": [
                    "Chicken (500 gm)",
                    "Red Chilli powder (1.5 tsp)",
                    "Soya bean oil (5 tbsp)",
                    "Turmeric powder (1 tsp)",
                    "Onion (3 medium size sliced)",
                    "Ginger paste (1 tsp)",
                    "Garlic paste (1 tbsp)",
                    "Cumin fried powder (1 tsp)",
                    "Whole Garam Masala (Cardamom 2 inch 1 pcs, Cinnamon 3 pieces, Cloves 5)",
                    "Potato 2 pcs medium size cut into 8 pcs",
                    "Coriander powder (1 tsp)",
                    "Salt (to taste)",
                    "Water (5 cup)"
                ],
                "cooking_method": [
                    "In a large pot or deep pan, heat 5 tbsp of Soya bean oil over medium heat.",
                    "Add the sliced onions and sauté until they turn translucent.",
                    "Add 1 tsp of ginger paste and 1 tbsp of garlic paste. Sauté for 1-2 minutes.",
                    "Add the chicken pieces and fry until they turn golden brown.",
                    "Add 1.5 tsp of red chilli powder, 1 tsp of turmeric powder, 1 tsp of cumin fried powder, and 1 tsp of coriander powder. Mix well and cook for a few minutes.",
                    "Add 5 cups of water, 2 pcs of medium-sized potatoes cut into 8 pieces, and whole garam masala (cardamom, cinnamon, and cloves). Mix well and bring it to a boil.",
                    "Cover the pot with a lid and let it simmer for 30-35 minutes or until the chicken is cooked and tender.",
                    "Remove the lid and add salt to taste. Mix well and cook for another 5 minutes.",
                    "Garnish with fresh coriander leaves.",
                    "Serve hot with rice or chapati."
                ],
                "rating": 5
            },
            {
                "id": 3,
                "name": "Bhuri Bhuna",
                "ingredients": [
                    "2 cups boiled and chopped Beef Tripe",
                    "3 tablespoon chopped onions",
                    "3 dry red chillies",
                    "3 tablespoon mustard oil",
                    "1.5 teaspoon termeric powder",
                    "2 teaspoon red chilli powder",
                    "3 teaspoon Coriander powder",
                    "2 teaspoon cumin powder",
                    "2 tablespoon ginger-garlic paste",
                    "1.5 cup water",
                    "2 bay leaves",
                    "2 teaspoon garam masala powder"
                ],
                "cooking_method": [
                    "Heat mustard oil in a deep pan over medium heat.",
                    "Add chopped onions, dry red chilies, and bay leaves. Stir and fry until the onions turn golden brown.",
                    "Add ginger-garlic paste and sauté for 1-2 minutes.",
                    "Add the boiled and chopped beef tripe and stir well.",
                    "Add turmeric powder, red chili powder, coriander powder, cumin powder, and salt to taste. Stir well and cook for 5-7 minutes.",
                    "Pour in 1.5 cups of water, cover the pan with a lid, and simmer for 30-40 minutes or until the beef tripe becomes tender and the water dries up.",
                    "Add garam masala powder and stir well. Cook for another 2-3 minutes.",
                    "Bhuri Bhuna is ready to serve. Serve it hot with rice or bread."
                ],
                "rating": 4.0
            }
        ],
        "likes": 1544
    },
    {
        "_id": "48270067-2787-4592-a23c-3476e4027bb0",
        "picture": "https://i.ibb.co/M7JfjyG/tony-khan.jpg",
        "name": "Tony Khan",
        "description": "Culinary expert Tony has a huge name is Bangladesh that is the reason many people are familiar with his abilities. Chef Tony is places at sixth position among top 10 chefs in Bangladesh. He is notable around the globe for his mixed cooking, in 1998 he got to be one of the “Main 10 Chefs of the World” and in 1992 he turned into the “Culinary expert of The Year” in Pacific Papuanew Guinea.",
        "years_of_experience": 10,
        "recipes_count": 3,
        "recipes": [
            {
                "id": 1,
                "name": "Palmyra",
                "ingredients": [
                    "1 cup pulp of Palmyra",
                    "1 cup semolina",
                    "2 cup refined flour",
                    "1 cup grated coconut",
                    "1 tbsp fennel seeds",
                    "1 cup milk",
                    "2 cup sugar",
                    "Oil for frying"
                ],
                "cooking_method": [
                    "In a mixing bowl, combine 1 cup of Palmyra pulp, 1 cup of semolina, 2 cups of refined flour, 1 cup of grated coconut, and 1 tablespoon of fennel seeds.",
                    "Gradually add 1 cup of milk to the mixture and stir well to form a smooth batter.",
                    "Heat oil in a frying pan over medium heat.",
                    "Drop spoonfuls of the batter into the hot oil and fry until golden brown.",
                    "Remove the fried cakes from the oil and drain on paper towels.",
                    "In another pan, add 2 cups of sugar and 1 cup of water, and cook over medium heat until the sugar dissolves and the mixture thickens to a syrup consistency.",
                    "Dip the fried cakes in the sugar syrup and let them soak for a few minutes.",
                    "Serve the Palmyra cakes hot or cold, garnished with chopped nuts or coconut flakes, if desired."
                ],
                "rating": 5
            },
            {
                "id": 2,
                "name": "Ice Apple",
                "ingredients": [
                    "1 cup pulp of Palmyra",
                    "1 cup semolina",
                    "2 cup refined flour",
                    "1 cup grated coconut",
                    "1 tbsp fennel seeds",
                    "1 cup milk",
                    "2 cup sugar",
                    "Oil for frying"
                ],
                "cooking_method": [
                    "In a mixing bowl, combine 1 cup of Palmyra pulp, 1 cup of semolina, 2 cups of refined flour, 1 cup of grated coconut, and 1 tablespoon of fennel seeds.",
                    "Gradually add 1 cup of milk to the mixture and stir well to form a smooth batter.",
                    "Heat oil in a frying pan over medium heat.",
                    "Drop spoonfuls of the batter into the hot oil and fry until golden brown.",
                    "Remove the fried cakes from the oil and drain on paper towels.",
                    "In another pan, add 2 cups of sugar and 1 cup of water, and cook over medium heat until the sugar dissolves and the mixture thickens to a syrup consistency.",
                    "Dip the fried cakes in the sugar syrup and let them soak for a few minutes.",
                    "Serve the Palmyra cakes hot or cold, garnished with chopped nuts or coconut flakes, if desired."
                ],
                "rating": 5
            },
            {
                "id": 3,
                "name": "Palm Fruit Malpua",
                "ingredients": [
                    "1 cup pulp of Palmyra",
                    "1 cup semolina",
                    "2 cup refined flour",
                    "1 cup grated coconut",
                    "1 tbsp fennel seeds",
                    "1 cup milk",
                    "2 cup sugar",
                    "Oil for frying"
                ],
                "cooking_method": [
                    "In a mixing bowl, combine 1 cup of Palmyra pulp, 1 cup of semolina, 2 cups of refined flour, 1 cup of grated coconut, and 1 tablespoon of fennel seeds.",
                    "Gradually add 1 cup of milk to the mixture and stir well to form a smooth batter.",
                    "Heat oil in a frying pan over medium heat.",
                    "Drop spoonfuls of the batter into the hot oil and fry until golden brown.",
                    "Remove the fried cakes from the oil and drain on paper towels.",
                    "In another pan, add 2 cups of sugar and 1 cup of water, and cook over medium heat until the sugar dissolves and the mixture thickens to a syrup consistency.",
                    "Dip the fried cakes in the sugar syrup and let them soak for a few minutes.",
                    "Serve the Palmyra cakes hot or cold, garnished with chopped nuts or coconut flakes, if desired."
                ],
                "rating": 5
            }
        ],
        "likes": 748
    },
    {
        "_id": "fff03417-3e66-46c6-8503-8b9383809c7f",
        "picture": "https://i.ibb.co/4V3Lqzh/manik-miah.jpg",
        "name": "Manik Miah",
        "description": "Manik Miah, the head culinary specialist from the Windsor Tiffin eatery in Burbage, contributed in the finals of the Curry Chef of the Year competition sorted out by the Bangladesh Caterers Association. The test saw 30 culinary specialists from over the UK showcased their aptitudes at Northampton College by making a mark dish in only 45 minutes. He picked a chicken dish, a classical korma – desi khas korma – alongside mint pilaw rice and a vegetable side dish, vegetable salan. He is now considered at the seventh most talented chef among top famous ten chefs in Bangladesh.",
        "years_of_experience": 8,
        "recipes_count": 3,
        "recipes": [
            {
                "id": 1,
                "name": "Rui Maacher Bharta",
                "ingredients": [
                    "80 gm Ruhu Fish (tastes better) from the stomach side or (peti pieces in bengali)",
                    "Dori, tilapia or salmon any kind of fish can be used but Rohu fish tastes better",
                    "2 onions sliced",
                    "2 red whole chilli fried in oil and mashed",
                    "2 cloves garlic and 1 inch of ginger grated and fried in oil and kept aside",
                    "Chopped fresh corriander",
                    "3 tablespoon mustard oil, olive oil can be used too",
                    "2 chopped green chilli (optional)",
                    "1 small tomato fine chopped",
                    "Salt to taste"
                ],
                "cooking_method": [
                    "Boil the fish pieces with a little bit of salt until they are fully cooked. Drain the water and set aside the fish pieces.",
                    "In a pan, heat mustard oil and fry the sliced onions until they turn golden brown.",
                    "Add the fried ginger-garlic paste to the pan and stir well.",
                    "Add the chopped tomato, green chillies (if using), and mashed red chillies to the pan and sauté for a few minutes.",
                    "Add the boiled fish pieces to the pan and mix well with the masala.",
                    "Add salt to taste and stir well.",
                    "Add chopped fresh coriander to the pan and mix well.",
                    "Serve hot with rice or roti."
                ],
                "rating": 5
            },
            {
                "id": 2,
                "name": "Khurbo (Chicken Stir Fry)",
                "ingredients": [
                    "1 chicken breast",
                    "1/2 tsp. salt",
                    "1/4 tsp. turmeric powder",
                    "1/4 tsp. red chili powder",
                    "1 tsp. oil",
                    "3-4 dry red chilies",
                    "4-5 garlic cloves",
                    "1 tsp. lemon juice or to taste",
                    "pinch salt (opt)",
                    "1 tsp. mustard oil",
                    "1 tbsp. kasundi (mustard sauce)",
                    "1 tbsp. coriander leaves"
                ],
                "cooking_method": [
                    "Cut the chicken breast into small bite-sized pieces.",
                    "Marinate the chicken pieces with salt, turmeric powder, red chili powder, and oil. Mix well and set aside for 10-15 minutes.",
                    "Heat a pan over medium heat and add the marinated chicken to the pan. Stir fry the chicken for 5-7 minutes or until cooked through.",
                    "In a separate pan, heat mustard oil over low-medium heat.",
                    "Add dry red chilies and garlic cloves to the pan and fry until the garlic turns light brown.",
                    "Add the stir-fried chicken to the pan with the fried garlic and chilies. Mix well.",
                    "Add lemon juice and a pinch of salt (if desired) to the pan and mix well.",
                    "Add kasundi (mustard sauce) to the pan and mix well. Cook for another 1-2 minutes.",
                    "Garnish with coriander leaves and serve hot."
                ],
                "rating": 4.0
            },
            {
                "id": 3,
                "name": "Mashed Ruhu Fish",
                "ingredients": [
                    "80 gm Ruhu Fish (tastes better) from the stomach side or (peti pieces in bengali)",
                    "Dori, tilapia or salmon any kind of fish can be used but Rohu fish tastes better",
                    "2 onions sliced",
                    "2 red whole chilli fried in oil and mashed",
                    "2 cloves garlic and 1 inch of ginger grated and fried in oil and kept aside",
                    "Chopped fresh corriander",
                    "3 tablespoon mustard oil, olive oil can be used too",
                    "2 chopped green chilli (optional)",
                    "1 small tomato fine chopped",
                    "Salt to taste"
                ],
                "cooking_method": [
                    "Boil the fish pieces with a little bit of salt until they are fully cooked. Drain the water and set aside the fish pieces.",
                    "In a pan, heat mustard oil and fry the sliced onions until they turn golden brown.",
                    "Add the fried ginger-garlic paste to the pan and stir well.",
                    "Add the chopped tomato, green chillies (if using), and mashed red chillies to the pan and sauté for a few minutes.",
                    "Add the boiled fish pieces to the pan and mix well with the masala.",
                    "Add salt to taste and stir well.",
                    "Add chopped fresh coriander to the pan and mix well.",
                    "Serve hot with rice or roti."
                ],
                "rating": 5
            }
        ],
        "likes": 974
    },
    {
        "_id": "1bac545a-2764-4f96-ade6-b1d6e622f500",
        "picture": "https://i.ibb.co/dLbNj0L/asmat-ali.jpg",
        "name": "Asmat Ali",
        "description": "Asmat Ali, referred to around Gandhi Mahal as Baisab (“sibling” in Bangla), has been head gourmet specialist since 2008. Conceived in Sylhet, Bangladesh, he spent quite a bit of his life working in Qatar before going to the United States in 2001. He is also included in the list of top 10 chefs in Bangladesh.",
        "years_of_experience": 7,
        "recipes_count": 3,
        "recipes": [
            {
                "id": 1,
                "name": "Dimer Shashranga",
                "ingredients": [
                    "4 Eggs: Big- Separated (Yolks & White) & set aside each of them separately",
                    "To Taste Salt",
                    "1 Cup Fresh Onion Birista",
                    "200-250 gms Plain Yoghurt + 1/2 tsp Sugar: Well Whisked",
                    "3-4 Tempering Spices: Green Cardamoms",
                    "4-5 Cloves",
                    "1 inch Cinnamon Stick",
                    "1 Onion: Finely Chopped or Pasted",
                    "1 tbsp (2 G) Paste: Ginger-Garlic Paste: (This recipe traditionally doesn’t call for this particular ingredients paste however, I preferred using it in it)",
                    "as required Water (Hot)",
                    "1 tbsp Black Peppercorns: Freshly Cracked",
                    "1 tsp Dry Roasted Cumins & Whole Dry Red Chilli Powder: Homemade",
                    "1 tsp Garam Masala Powder: Homemade",
                    "1/4 Cup Ghee/Cooking Oil or Both: For Cooking this particular Recipe- (This recipe calls for it entirely, however I’ve mixed in both the ghee & cooking oil in it all along)",
                    "3-4 Green Chillies: Slit"
                ],
                "cooking_method": [
                    "In a mixing bowl, beat the egg whites with a pinch of salt until they become stiff peaks.",
                    "In another bowl, beat the egg yolks with a pinch of salt until they become frothy.",
                    "Fold the egg whites into the egg yolks and mix well.",
                    "Heat ghee and cooking oil in a pan over medium heat.",
                    "Add the tempering spices (green cardamom, cloves, cinnamon stick) and fry for a few seconds until fragrant.",
                    "Add chopped or pasted onion and ginger-garlic paste to the pan and sauté until golden brown.",
                    "Add the freshly cracked black peppercorns and homemade cumin and whole dry red chili powder. Mix well.",
                    "Add the beaten eggs to the pan and stir well.",
                    "Add hot water to the pan and mix well. Cover the pan with a lid and cook for 5-7 minutes or until the eggs are cooked through.",
                    "Add the garam masala powder, slit green chillies, and fresh onion birista to the pan. Mix well and cook for another 2-3 minutes.",
                    "Finally, add the well-whisked yoghurt with sugar to the pan and mix well. Cook for another 2-3 minutes.",
                    "Garnish with coriander leaves and serve hot with rice or bread."
                ],
                "rating": 5
            },
            {
                "id": 2,
                "name": "Salad",
                "ingredients": [
                    "Half cup carrot cubes",
                    "Half cup potato cubes",
                    "2 tbs matar",
                    "1 tbs oil",
                    "Pinch salt",
                    "Pinch black pepper"
                ],
                "cooking_method": [
                    "Wash and peel the carrot and potato, and cut them into small cubes.",
                    "In a mixing bowl, combine the carrot and potato cubes with the matar (green peas).",
                    "Add a pinch of salt and black pepper, and drizzle 1 tablespoon of oil over the salad.",
                    "Toss the salad gently until everything is well mixed.",
                    "Serve the salad chilled as a side dish with your main course."
                ],
                "rating": 5
            },
            {
                "id": 3,
                "name": "Egg Shashrang",
                "ingredients": [
                    "4 Eggs: Big- Separated (Yolks & White) & set aside each of them separately",
                    "To Taste Salt",
                    "1 Cup Fresh Onion Birista",
                    "200-250 gms Plain Yoghurt + 1/2 tsp Sugar: Well Whisked",
                    "3-4 Tempering Spices: Green Cardamoms",
                    "4-5 Cloves",
                    "1 inch Cinnamon Stick",
                    "1 Onion: Finely Chopped or Pasted",
                    "1 tbsp (2 G) Paste: Ginger-Garlic Paste: (This recipe traditionally doesn’t call for this particular ingredients paste however, I preferred using it in it)",
                    "as required Water (Hot)",
                    "1 tbsp Black Peppercorns: Freshly Cracked",
                    "1 tsp Dry Roasted Cumins & Whole Dry Red Chilli Powder: Homemade",
                    "1 tsp Garam Masala Powder: Homemade",
                    "1/4 Cup Ghee/Cooking Oil or Both: For Cooking this particular Recipe- (This recipe calls for it entirely, however I’ve mixed in both the ghee & cooking oil in it all along)",
                    "3-4 Green Chillies: Slit"
                ],
                "cooking_method": [
                    "In a mixing bowl, beat the egg whites with a pinch of salt until they become stiff peaks.",
                    "In another bowl, beat the egg yolks with a pinch of salt until they become frothy.",
                    "Fold the egg whites into the egg yolks and mix well.",
                    "Heat ghee and cooking oil in a pan over medium heat.",
                    "Add the tempering spices (green cardamom, cloves, cinnamon stick) and fry for a few seconds until fragrant.",
                    "Add chopped or pasted onion and ginger-garlic paste to the pan and sauté until golden brown.",
                    "Add the freshly cracked black peppercorns and homemade cumin and whole dry red chili powder. Mix well.",
                    "Add the beaten eggs to the pan and stir well.",
                    "Add hot water to the pan and mix well. Cover the pan with a lid and cook for 5-7 minutes or until the eggs are cooked through.",
                    "Add the garam masala powder, slit green chillies, and fresh onion birista to the pan. Mix well and cook for another 2-3 minutes.",
                    "Finally, add the well-whisked yoghurt with sugar to the pan and mix well. Cook for another 2-3 minutes.",
                    "Garnish with coriander leaves and serve hot with rice or bread."
                ],
                "rating": 5
            }
        ],
        "likes": 869
    },
    {
        "_id": "877e35b0-4c6e-4162-9a88-63e32ce83918",
        "picture": "https://i.ibb.co/gWfJkxY/haji-fakruddin.jpg",
        "name": "Haji Fakruddin",
        "description": "Since 1966, Haji Fakruddin had challenged outrageous financial hardships since his move to Bangladesh. He amid a stretch to squeeze out a work, he was acquainted with Muslim Miah, a culinary specialist to the Nawabs of Bangladesh.",
        "years_of_experience": 20,
        "recipes_count": 3,
        "recipes": [
            {
                "id": 1,
                "name": "Kacchi Biryani",
                "ingredients": [
                    "1 1/2 kg chicken",
                    "1 teaspoon ginger paste",
                    "2 teaspoon garlic paste",
                    "3-4 dry red chilli",
                    "2-3 stick cinnamon, half inches each",
                    "4-5 green cardamom",
                    "1 teaspoon cumin",
                    "1/2 teaspoon cloves",
                    "1/2 teaspoon mace",
                    "1/8 teaspoon nutmeg",
                    "6-8 allspice (optional)",
                    "1/2 teaspoon fennel seed (optional)",
                    "3 tablespoon yogurt",
                    "3/4 cup ghee or butter",
                    "5 medium potato",
                    "pinch orange food colour (optional)",
                    "1/2 cup onion, thinly sliced",
                    "4 cups basmati Rice",
                    "6 cups water",
                    "1/2 cup condensed milk",
                    "2 tablespoon milk",
                    "pinch saffron",
                    "10-12 alubokhara",
                    "to taste Salt, according"
                ],
                "cooking_method": [
                    "Clean and wash the chicken thoroughly, then marinate it with ginger paste, garlic paste, yogurt, and salt. Keep it aside for at least 2 hours or more.",
                    "In a separate pan, fry the thinly sliced onions until they turn golden brown. Remove from the oil and keep aside.",
                    "In the same oil, add the marinated chicken along with dry red chili, cinnamon sticks, green cardamom, cumin, cloves, mace, nutmeg, allspice, and fennel seeds (if using). Cook the chicken until it becomes tender.",
                    "In a separate pot, boil 6 cups of water, add salt, and then add basmati rice to the pot. Cook until the rice is about 70% done. Drain the water and keep the rice aside.",
                    "In a separate pot, heat ghee or butter, add thinly sliced onions, and fry until they turn golden brown. Add boiled potatoes and fry them until they are slightly golden. Remove from the pot and keep aside.",
                    "Now, in a large pot or handi, add the cooked chicken and spread it evenly. Add the half-cooked rice over the chicken, spreading it evenly. Pour condensed milk mixed with milk, saffron, and food color (if using) over the rice. Top the rice with fried onions, alubokhara, and fried potatoes. Cover the pot with a lid.",
                    "Place the pot on a low heat for 20-25 minutes or until the rice is fully cooked and fluffy. You can also place the pot in the oven for 20-25 minutes at 180°C (350°F) if you prefer.",
                    "Once the biryani is cooked, serve hot with raita and salad. Enjoy your delicious Kacchi Biryani!"
                ],
                "rating": 5
            },
            {
                "id": 2,
                "name": "Puin-Chingri",
                "ingredients": [
                    "6-8 Prawns/Shrimps: Shelled & Veined- (Lightly sautéed with some salt & turmeric)",
                    "250-300 gms Basalle Alba Spinach/Puin Shaak- Commonly known as the Malabar Spinach in India- though both aren’t the same…however it belongs to the same family/species)",
                    "1 Potato: Medium- Diced into small Cubes- Lightly Sautéed & Set Aside",
                    "1 tsp PanchPhoron",
                    "1 tsp Red Chilli Powder",
                    "1/2 tsp Turmeric",
                    "1/4 tsp Sugar: Optional (Recommend, since Bengali Dishes usually do have it in almost all, not for the sweet tastes but to balance the tartness of the salt)",
                    "as per taste Water (Warm)",
                    "2-3 tbsps Shredded Coconut: Any- Fresh or Desiccated",
                    "4 tbsps Mustard Oil: (Mandatory)"
                ],
                "cooking_method": [
                    "Wash and chop the Puin Shaak (Malabar Spinach) and set aside.",
                    "Heat 2 tablespoons of mustard oil in a pan and add 1 teaspoon of PanchPhoron.",
                    "Once the spices start to splutter, add the chopped Puin Shaak and sauté for 2-3 minutes.",
                    "Add 1/2 teaspoon of turmeric powder, 1 teaspoon of red chilli powder, and salt to taste. Mix well and sauté for another 2-3 minutes.",
                    "Add warm water to the pan, cover and let it simmer for 5-7 minutes until the Puin Shaak is cooked.",
                    "In a separate pan, heat 1 tablespoon of mustard oil and sauté the diced potatoes until lightly browned. Set aside.",
                    "Add the sautéed prawns to the Puin Shaak mixture and mix well. Cook for 2-3 minutes.",
                    "Add the sautéed potatoes, 1/4 teaspoon of sugar (optional) and mix well.",
                    "Add 2-3 tablespoons of shredded coconut and mix well.",
                    "Simmer for 2-3 minutes until the flavors are well combined.",
                    "In a small bowl, mix 2 tablespoons of condensed milk, 2 tablespoons of milk, and a pinch of saffron. Set aside.",
                    "In a separate pot, cook 4 cups of basmati rice with 6 cups of water and salt to taste.",
                    "Once the rice is cooked, strain any excess water and mix in the Puin Shaak and prawn mixture.",
                    "Drizzle the saffron milk mixture over the top of the rice and mix lightly.",
                    "Cover the pot with a tight-fitting lid and let it cook on low heat for 10-15 minutes until the flavors are well combined.",
                    "Serve hot with raita and papad. Enjoy!"
                ],
                "rating": 4.5
            },
            {
                "id": 3,
                "name": "Cauliflower Korma",
                "ingredients": [
                    "1 medium size cauliflower",
                    "1 medium size onion",
                    "5-6 garlic pods",
                    "2 inch ginger",
                    "4 green chillies",
                    "9-10 cashew nuts",
                    "3 tsp curd",
                    "1/2 tsp red chilli powder",
                    "1 tbsp freshly grated coconut",
                    "1 bay leaf",
                    "1 inch cinnamon stick",
                    "5-6 black peppercorns",
                    "1 tsp sugar",
                    "to taste Salt",
                    "1 tsp garam masala powder",
                    "1 tsp ghee",
                    "As needed Oil",
                    "As needed Water",
                    "2 tsp fried onions for garnishing"
                ],
                "cooking_method": [
                    "Cut the cauliflower into small florets and soak them in salt water for 10 minutes.",
                    "Heat oil in a pan and add bay leaf, cinnamon, and black peppercorns. Saute them for a few seconds until the spices release their aroma.",
                    "Add finely chopped onions and saute them until they turn translucent.",
                    "Add chopped garlic, ginger, and green chillies to the pan and saute them until the raw smell disappears.",
                    "Add chopped tomatoes, red chilli powder, and salt. Cook the tomatoes until they turn soft and mushy.",
                    "Add cashew nuts, grated coconut, and curd to the pan. Mix everything well and cook for 2-3 minutes.",
                    "Turn off the heat and let the mixture cool down. Once it cools down, grind it into a smooth paste.",
                    "Heat oil in the same pan and add the cauliflower florets. Fry them for 3-4 minutes until they turn golden brown.",
                    "Add the ground paste to the pan and mix everything well. Add some water if needed to adjust the consistency.",
                    "Add garam masala powder, sugar, and some salt if needed. Mix everything well and let it cook for 5-7 minutes until the cauliflower is cooked and the gravy thickens.",
                    "Add a teaspoon of ghee and mix everything well. Garnish with fried onions and serve hot with rice or roti."
                ],
                "rating": 4.2
            }
        ],
        "likes": 1475
    }
]
